---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.InvalidRebarHostNonStructural
source: html/6499b567-467d-cf36-3baa-beb5c4ed6f06.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.InvalidRebarHostNonStructural Property

Rebar can't be placed in a non-structural element.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidRebarHostNonStructural { get; }
```